import 'dart:io';

import 'package:test/test.dart';

void main() {
  // Задача 1
  // 1) Напишите программу, которая выводит все четные числа от 1 до 20.

// for (var i = 1; i < 20; i++) {
//   if (i % 2 == 0) {
//     print(i);
//   }
// }

// Задача 2
// Создайте цикл, который выводит таблицу умножения для определенного числа (например, 5 * 1 = 5 и тд. от 1 до 9).
// print("Введите число");
// int num = int.parse(stdin.readLineSync()!);
// int summ = 0;
// for (var i = 1; i < 10; i++) {
//   summ = num * i;
//   print("$num * $i = $summ");
// }

// Задача №3
// Напишите программу, которая запрашивает у пользователя число и выводит факториал этого числа (Факториал — это произведение всех натуральных чисел от 1 до данного числа. Например, факториал числа 5 будет равен 1 × 2 × 3 × 4 × 5 = 120.)
// print("Введите число");
// int num = int.parse(stdin.readLineSync()!);
// int factorial = 1;
// for (var i = 1; i <= num; i++) {
//   factorial *= i;
// }
// print(factorial);

// Задача №4
// Используйте массив чисел, например, List<int> nums = [10, 5, 8, 3, 12];, чтобы найти наименьший и наибольший элементы.
//  List<int> nums = [10, 5, 8, 3, 12];
//  nums.sort();
// print('${nums.first} ${nums.last}');

// задача №5
// Создайте массив чисел (List<int> values = [10, 20, 30, 40, 50];), и найдите среднее значение всех элементов.
List<int> values = [10, 20, 30, 40, 50];



}